#Напишите программу, которая приветствует пользователя,
#  выводя слово Hello, 
#введенное имя и знаки препинания по образцу
Name_ = str(input())
print('Hello, ' + Name_ + '!')